<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="2" name="input_seq" type="Parameter" version="opset1">
			<data shape="1,512" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_seq"/>
				<attribute name="old_api_map_element_type" version="0" value="i32"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_seq">
					<dim>1</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_mask" type="Parameter" version="opset1">
			<data shape="1,1,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_mask"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input_mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D,C]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="pos_mask" type="Parameter" version="opset1">
			<data shape="1,1,512,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pos_mask"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="pos_mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D,C,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="3" name="model.embedding.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="148, 256" offset="0" size="75776"/>
			<output>
				<port id="0" precision="FP16">
					<dim>148</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model.embedding.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.embedding.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>148</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.embedding.weight">
					<dim>148</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_257" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="75776" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_257"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="6" name="402" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="402"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>148</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="402">
					<dim>1</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_259" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="75784" size="24"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_259"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="403" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="403"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="403">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model.dur_pred.convs.0.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 5" offset="75808" size="655360"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model.dur_pred.convs.0.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.dur_pred.convs.0.conv.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.dur_pred.convs.0.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="404" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="404"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="404">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="405" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="405"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="405">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_20761_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="731168" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_20761" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="406, model.dur_pred.convs.0.bnorm.bias, model.dur_pred.convs.0.bnorm.running_mean, model.dur_pred.convs.0.bnorm.running_var, model.dur_pred.convs.0.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Multiply_21373" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="406, model.dur_pred.convs.0.bnorm.bias, model.dur_pred.convs.0.bnorm.running_mean, model.dur_pred.convs.0.bnorm.running_var, model.dur_pred.convs.0.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_21378_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="731680" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_21378" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="406" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="406, model.dur_pred.convs.0.bnorm.bias, model.dur_pred.convs.0.bnorm.running_mean, model.dur_pred.convs.0.bnorm.running_var, model.dur_pred.convs.0.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="406">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model.dur_pred.convs.1.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 5" offset="732192" size="655360"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model.dur_pred.convs.1.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.dur_pred.convs.1.conv.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.dur_pred.convs.1.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="407" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="407"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="407">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="408" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="408"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="408">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_20887_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="1387552" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_20887" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="409, model.dur_pred.convs.1.bnorm.bias, model.dur_pred.convs.1.bnorm.running_mean, model.dur_pred.convs.1.bnorm.running_var, model.dur_pred.convs.1.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Multiply_21380" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="409, model.dur_pred.convs.1.bnorm.bias, model.dur_pred.convs.1.bnorm.running_mean, model.dur_pred.convs.1.bnorm.running_var, model.dur_pred.convs.1.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_21385_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="1388064" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_21385" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="409" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="409, model.dur_pred.convs.1.bnorm.bias, model.dur_pred.convs.1.bnorm.running_mean, model.dur_pred.convs.1.bnorm.running_var, model.dur_pred.convs.1.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="409">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model.dur_pred.convs.2.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 5" offset="1388576" size="655360"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model.dur_pred.convs.2.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.dur_pred.convs.2.conv.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.dur_pred.convs.2.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="410" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="410"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="410">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="411" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="411"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="411">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_21013_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="2043936" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_21013" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="412, model.dur_pred.convs.2.bnorm.bias, model.dur_pred.convs.2.bnorm.running_mean, model.dur_pred.convs.2.bnorm.running_var, model.dur_pred.convs.2.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Multiply_21387" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="412, model.dur_pred.convs.2.bnorm.bias, model.dur_pred.convs.2.bnorm.running_mean, model.dur_pred.convs.2.bnorm.running_var, model.dur_pred.convs.2.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_21392_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="2044448" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_21392" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="412" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="412, model.dur_pred.convs.2.bnorm.bias, model.dur_pred.convs.2.bnorm.running_mean, model.dur_pred.convs.2.bnorm.running_var, model.dur_pred.convs.2.bnorm.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="412">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="416" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="416"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="416">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_273" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2044960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_273"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="413" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="413"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="413">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_275" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2044968" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_275"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="414" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="414"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="414">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="415" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="415"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="415">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_21496_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="2044976" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_21496" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="462" type="Equal" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="462, 463"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="462,463">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="464_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2044978" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="49" name="464" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="464"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32" names="464"/>
			</output>
		</layer>
		<layer id="50" name="model.dur_pred.att_enc.attn_layers.0.conv_q.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="2044980" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="model.dur_pred.att_enc.attn_layers.0.conv_q.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.dur_pred.att_enc.attn_layers.0.conv_q.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.dur_pred.att_enc.attn_layers.0.conv_q.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Convolution_279" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_279"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_299_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="2176052" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_299" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="417" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="417, Concat_298, Reshape_299"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="417">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model.dur_pred.att_enc.attn_layers.0.conv_k.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="2176564" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model.dur_pred.att_enc.attn_layers.0.conv_k.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.dur_pred.att_enc.attn_layers.0.conv_k.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.dur_pred.att_enc.attn_layers.0.conv_k.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Convolution_327" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_327"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_347_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="2307636" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_347" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="418" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="418, Concat_346, Reshape_347"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="418">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="420" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="420, 423, 426"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="420,423,426">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_15410" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="75776" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="421, 422, 434, Constant_425, Constant_439"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_425" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="75776" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_425"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="65" name="422" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="421, 422, 434, Constant_425, Constant_439"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="434">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="1214" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2308148" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1214"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1214">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1215" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2308156" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1215"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1215">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="429" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="429"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="429">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_15419" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2044960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="430, 431, 437, Constant_437, Constant_441"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_437" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="75776" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_437"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="71" name="431" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="430, 431, 437, Constant_437, Constant_441"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="437">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="438" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1214, 1215, 438"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="438">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="439" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="439"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="439">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_492" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2308164" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_492"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="440" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="440"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="440">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_18103" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="75776" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1216" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2308148" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1216"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1216">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="1217" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2308156" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1217"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1217">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_15437" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2044960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="427, 428, 446, Constant_433, Constant_496"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_433" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="75776" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_433"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="81" name="428" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="427, 428, 446, Constant_433, Constant_496"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="446">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="447" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1216, 1217, 447"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="448" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="448"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="448">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_21497_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="2308196" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_21497" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Multiply_21408" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="448, 458, 459, 460"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="460" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="448, 458, 459, 460"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="460">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="465" type="Select" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="465"/>
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32"/>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="465">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="466" type="SoftMax" version="opset8">
			<data axis="3"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="466"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="466">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model.dur_pred.att_enc.attn_layers.0.conv_v.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="2308198" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model.dur_pred.att_enc.attn_layers.0.conv_v.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.dur_pred.att_enc.attn_layers.0.conv_v.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.dur_pred.att_enc.attn_layers.0.conv_v.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Convolution_375" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_375"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_395_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="2439270" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_395" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="419" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="419, Concat_394, Reshape_395"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="419">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_15446" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="75776" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="421, 422, 451, Constant_425, Constant_547"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="4220" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="421, 422, 451, Constant_425, Constant_547"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="451">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="1218" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2308148" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1218"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1218">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="1219" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2308156" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1219"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1219">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_15455" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2044960" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="427, 428, 454, Constant_433, Constant_549"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="4280" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="427, 428, 454, Constant_433, Constant_549"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="454">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="455" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1218, 1219, 455"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="455">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="456" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="456"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="456">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_600" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2308164" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_600"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="457" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="457"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="457">
					<dim>1</dim>
					<dim>4</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="467" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="467"/>
			</rt_info>
