<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="2" name="data" type="Parameter" version="opset1">
			<data shape="1,512,256" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>512</dim>
					<dim>256</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mask" type="Parameter" version="opset1">
			<data shape="1,1,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mask"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data_mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D,C]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="pos_mask" type="Parameter" version="opset1">
			<data shape="1,1,512,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pos_mask"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="pos_mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D,C,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_243" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_243"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="402" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="402"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="402">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="406" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="406"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="406">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_245" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_245"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="403" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="403"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="403">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_247" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_247"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="404" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="404"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="404">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="405" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="405"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="405">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_20724_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="40" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_20724" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="461" type="Equal" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="461, 462"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="461,462">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="463_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="42" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="15" name="463" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="463"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32" names="463"/>
			</output>
		</layer>
		<layer id="16" name="model.att_enc.attn_layers.0.conv_q.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="44" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model.att_enc.attn_layers.0.conv_q.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.att_enc.attn_layers.0.conv_q.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.att_enc.attn_layers.0.conv_q.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Convolution_251" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_251"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_271_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="131116" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_271" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="407" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="407, Concat_270, Reshape_271"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="407">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model.att_enc.attn_layers.0.conv_k.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="131628" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model.att_enc.attn_layers.0.conv_k.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.att_enc.attn_layers.0.conv_k.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.att_enc.attn_layers.0.conv_k.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Convolution_299" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_299"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_319_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="262700" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_319" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="408" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="408, Concat_318, Reshape_319"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="408">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="410" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="410, 413, 416"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="410,413,416">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_14880" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="263212" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="411, 412, 424, Constant_397, Constant_411"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_397" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="263212" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_397"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="31" name="412" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="411, 412, 424, Constant_397, Constant_411"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="424">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="1270" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1270"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1270">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="1271" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="263220" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1271"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1271">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="419" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="419"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="419">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_14889" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="420, 421, 427, Constant_409, Constant_413"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_409" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="263212" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_409"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="37" name="421" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="420, 421, 427, Constant_409, Constant_413"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="427">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="428" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1270, 1271, 428"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="428">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="429" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="429"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="429">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_464" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="263228" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_464"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="430" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="430"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="430">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_17573" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="263212" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="1272" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1272"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1272">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="1273" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="263220" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1273"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1273">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_14907" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="417, 418, 436, Constant_405, Constant_468"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_405" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="263212" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_405"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="47" name="418" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="417, 418, 436, Constant_405, Constant_468"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="436">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="437" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1272, 1273, 437"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="438" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="438"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="438">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_20725_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="263260" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_20725" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Multiply_20636" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="438, 448, 449, 450"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="450" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="438, 448, 449, 450"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="450">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_20016_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 9, 128" offset="263262" size="2304"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_20016" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="1277, 453"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="453" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1277, 453"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="453">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_578" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="263228" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_578"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="454" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="454"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="454">
					<dim>1</dim>
					<dim>2</dim>
					<dim>9</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="455" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="455"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>9</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="455">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="456" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="456"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="456">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_20726_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="263260" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_20726" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="458" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="457, 458"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="458">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="459" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="459"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="459">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="464" type="Select" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="464"/>
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32"/>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="464">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="465" type="SoftMax" version="opset8">
			<data axis="3"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="465"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="465">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model.att_enc.attn_layers.0.conv_v.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="265566" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model.att_enc.attn_layers.0.conv_v.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.att_enc.attn_layers.0.conv_v.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.att_enc.attn_layers.0.conv_v.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Convolution_347" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_347"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_367_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="396638" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Reshape_367" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="409" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="409, Concat_366, Reshape_367"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="409">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_14916" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="263212" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="411, 412, 441, Constant_397, Constant_519"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="4120" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="411, 412, 441, Constant_397, Constant_519"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="441">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="1274" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1274"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1274">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="1275" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="263220" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1275"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="1275">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_14925" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="417, 418, 444, Constant_405, Constant_521"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="4180" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="417, 418, 444, Constant_405, Constant_521"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="444">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="445" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1274, 1275, 445"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="445">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="446" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="446"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="446">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_572" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="263228" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_572"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="447" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="447"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="447">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="466" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="466"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="466">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="472" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="472"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="472">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_20023_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 9, 128" offset="397150" size="2304"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_20023" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="1279, 469"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="469" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1279, 469"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="469">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_20030_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 128, 9" offset="399454" size="2304"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_20030" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="1280, 471"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="471" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1280, 471"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="471">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="473" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="473"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="473">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="474" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="474"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="474">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_597" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="263228" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_597"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="475" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="475"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="475">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_15360" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="401758" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="479"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_15361" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="263212" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="97" name="Gather_15362" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="479"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_14952" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="420, 421, 478, Constant_409, Constant_603"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="4210" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="420, 421, 478, Constant_409, Constant_603"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="478">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="479" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="479"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="479">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="480" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="480"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="480">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="model.att_enc.attn_layers.0.conv_o.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1" offset="401774" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model.att_enc.attn_layers.0.conv_o.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model.att_enc.attn_layers.0.conv_o.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model.att_enc.attn_layers.0.conv_o.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Convolution_666" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_666"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_686_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="532846" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_686" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="481" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
